In [52]:
import pandas as pd
import numpy as np

In [53]:
# pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
row = ['mohali','chandigarh','panchkula']
col = ['area','population','rating']
ser = np.array([[11,22,33],[34,5,3],[5,66,77]])
# df = pd.DataFrame(b,a)

In [54]:
df = pd.DataFrame(data = ser,index = row,columns = col)

In [55]:
df

            area  population  rating
mohali        11          22      33
chandigarh    34           5       3
panchkula      5          66      77

In [56]:
df['area']

mohali        11
chandigarh    34
panchkula      5
Name: area, dtype: int64

In [57]:
df['population']

mohali        22
chandigarh     5
panchkula     66
Name: population, dtype: int64

In [58]:
df['rating']

mohali        33
chandigarh     3
panchkula     77
Name: rating, dtype: int64

In [59]:
df['area'][0:1]

mohali    11
Name: area, dtype: int64

In [60]:
# DataFrame.at : Access a single value for a row/column label pair
# DataFrame.iloc : Access group of rows and columns by integer position(s)
# DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
#     Series/DataFrame.
# Series.loc : Access group of values using labels
df.loc['mohali']

area          11
population    22
rating        33
Name: mohali, dtype: int64

In [61]:
df.loc['mohali','area']

11

In [62]:
print(df)
df<10

            area  population  rating
mohali        11          22      33
chandigarh    34           5       3
panchkula      5          66      77

             area  population  rating
mohali      False       False   False
chandigarh  False        True    True
panchkula    True       False   False

In [63]:
df[df<10]

            area  population  rating
mohali       NaN         NaN     NaN
chandigarh   NaN         5.0     3.0
panchkula    5.0         NaN     NaN

In [64]:
print(df)
df[df['rating']<10]

            area  population  rating
mohali        11          22      33
chandigarh    34           5       3
panchkula      5          66      77

            area  population  rating
chandigarh    34           5       3

In [68]:
df['rating']<10

mohali        False
chandigarh     True
panchkula     False
Name: rating, dtype: bool

In [73]:
print(df)
df[df['population']/df['area']>df.loc['chandigarh','population']/df.loc['chandigarh','area']]

            area  population  rating
mohali        11          22      33
chandigarh    34           5       3
panchkula      5          66      77

           area  population  rating
mohali       11          22      33
panchkula     5          66      77

In [74]:
df['density'] = df['population']/df['area']

In [75]:
df

            area  population  rating    density
mohali        11          22      33   2.000000
chandigarh    34           5       3   0.147059
panchkula      5          66      77  13.200000

In [76]:
# df.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
df.drop(labels='mohali')

            area  population  rating    density
chandigarh    34           5       3   0.147059
panchkula      5          66      77  13.200000

In [79]:
df.drop(columns='area')

            population  rating    density
mohali              22      33   2.000000
chandigarh           5       3   0.147059
panchkula           66      77  13.200000